#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
random_password.db_pass_api: Refreshing state... [id=none]
random_password.db_pass_identity: Refreshing state... [id=none]
random_password.db_pass_notifications: Refreshing state... [id=none]
random_password.db_pass_gm50x: Refreshing state... [id=none]
mongodbatlas_project.fiap_x: Refreshing state... [id=679e3869587fd45ba3d1e7b2]
mongodbatlas_database_user.db_user_gm50x: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:Njc5ZTM4Njk1ODdmZDQ1YmEzZDFlN2Iy-dXNlcm5hbWU=:Z201MHgtYWRtaW4=]
mongodbatlas_database_user.db_user_api: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:Njc5ZTM4Njk1ODdmZDQ1YmEzZDFlN2Iy-dXNlcm5hbWU=:YXBpLWFwcA==]
mongodbatlas_project_ip_access_list.allow_all_access: Refreshing state... [id=ZW50cnk=:MC4wLjAuMC8w-cHJvamVjdF9pZA==:Njc5ZTM4Njk1ODdmZDQ1YmEzZDFlN2Iy]
mongodbatlas_database_user.db_user_notifications: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:Njc5ZTM4Njk1ODdmZDQ1YmEzZDFlN2Iy-dXNlcm5hbWU=:bm90aWZpY2F0aW9ucy1hcHA=]
mongodbatlas_database_user.db_user_identity: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:Njc5ZTM4Njk1ODdmZDQ1YmEzZDFlN2Iy-dXNlcm5hbWU=:aWRlbnRpdHktYXBw]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # mongodbatlas_cluster.fiap_x will be created
  + resource "mongodbatlas_cluster" "fiap_x" {
      + accept_data_risks_and_force_replica_set_reconfig = (known after apply)
      + auto_scaling_compute_enabled                     = (known after apply)
      + auto_scaling_compute_scale_down_enabled          = (known after apply)
      + auto_scaling_disk_gb_enabled                     = (known after apply)
      + backing_provider_name                            = "AWS"
      + backup_enabled                                   = (known after apply)
      + cloud_backup                                     = (known after apply)
      + cluster_id                                       = (known after apply)
      + cluster_type                                     = "REPLICASET"
      + connection_strings                               = (known after apply)
      + container_id                                     = (known after apply)
      + disk_size_gb                                     = 0.5
      + encryption_at_rest_provider                      = (known after apply)
      + id                                               = (known after apply)
      + mongo_db_major_version                           = (known after apply)
      + mongo_db_version                                 = (known after apply)
      + mongo_uri                                        = (known after apply)
      + mongo_uri_updated                                = (known after apply)
      + mongo_uri_with_options                           = (known after apply)
      + name                                             = "FiapX"
      + num_shards                                       = (known after apply)
      + paused                                           = (known after apply)
      + pit_enabled                                      = (known after apply)
      + project_id                                       = "679e3869587fd45ba3d1e7b2"
      + provider_auto_scaling_compute_max_instance_size  = (known after apply)
      + provider_auto_scaling_compute_min_instance_size  = (known after apply)
      + provider_disk_iops                               = (known after apply)
      + provider_disk_type_name                          = (known after apply)
      + provider_encrypt_ebs_volume                      = (known after apply)
      + provider_encrypt_ebs_volume_flag                 = (known after apply)
      + provider_instance_size_name                      = "M0"
      + provider_name                                    = "TENANT"
      + provider_region_name                             = "US_EAST_1"
      + provider_volume_type                             = (known after apply)
      + redact_client_log_data                           = (known after apply)
      + replication_factor                               = (known after apply)
      + snapshot_backup_policy                           = (known after apply)
      + srv_address                                      = (known after apply)
      + state_name                                       = (known after apply)
      + termination_protection_enabled                   = (known after apply)
      + version_release_system                           = (known after apply)

      + advanced_configuration (known after apply)

      + bi_connector_config (known after apply)

      + replication_specs (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mongodb_connection_string      = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - MongoDB Atlas`*